; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city6)
	(fuel-level plane1 fl2)
	(at plane2 city8)
	(fuel-level plane2 fl2)
	(at plane3 city4)
	(fuel-level plane3 fl6)
	(at plane4 city6)
	(fuel-level plane4 fl6)
	(at plane5 city5)
	(fuel-level plane5 fl5)
	(at plane6 city0)
	(fuel-level plane6 fl2)
	(at plane7 city10)
	(fuel-level plane7 fl4)
	(at person1 city8)
	(at person2 city8)
	(at person3 city4)
	(at person4 city4)
	(at person5 city1)
	(at person6 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane4 city5)
	(at person1 city8)
	(at person2 city8)
	(at person3 city0)
	(at person4 city8)
	(at person5 city3)
	))

)

; plan
1. (zoom plane4 city6 city1 fl6 fl5 fl4)
   deleted: (at plane4 city6) (fuel-level plane4 fl6)
   added: (at plane4 city1) (fuel-level plane4 fl4)
   goals met: 2 of 6
2. (board person5 plane4 city1)
   deleted: (at person5 city1)
   added: (in person5 plane4)
   goals met: 2 of 6
3. (zoom plane4 city1 city3 fl4 fl3 fl2)
   deleted: (at plane4 city1) (fuel-level plane4 fl4)
   added: (at plane4 city3) (fuel-level plane4 fl2)
   goals met: 2 of 6
4. (debark person5 plane4 city3)
   deleted: (in person5 plane4)
   added: (at person5 city3)
   goals met: 3 of 6
5. (zoom plane4 city3 city5 fl2 fl1 fl0)
   deleted: (at plane4 city3) (fuel-level plane4 fl2)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 4 of 6
6. (board person4 plane3 city4)
   deleted: (at person4 city4)
   added: (in person4 plane3)
   goals met: 4 of 6
7. (board person3 plane3 city4)
   deleted: (at person3 city4)
   added: (in person3 plane3)
   goals met: 4 of 6
8. (zoom plane3 city4 city0 fl6 fl5 fl4)
   deleted: (at plane3 city4) (fuel-level plane3 fl6)
   added: (at plane3 city0) (fuel-level plane3 fl4)
   goals met: 4 of 6
9. (debark person3 plane3 city0)
   deleted: (in person3 plane3)
   added: (at person3 city0)
   goals met: 5 of 6
10. (zoom plane3 city0 city8 fl4 fl3 fl2)
   deleted: (at plane3 city0) (fuel-level plane3 fl4)
   added: (at plane3 city8) (fuel-level plane3 fl2)
   goals met: 5 of 6
11. (debark person4 plane3 city8)
   deleted: (in person4 plane3)
   added: (at person4 city8)
   goals met: 6 of 6
